In [1]:
import pandas as pd
import numpy as np

In [2]:
students = pd.read_csv('./StudentsPerformance.csv')

In [3]:
students.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [4]:
students.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [5]:
students.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [6]:
students.size

8000

In [7]:
students.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [8]:
students_with_names = students.iloc[[0, 2, 4, 7, 10]]

In [9]:
students_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
10,male,group C,associate's degree,standard,none,58,54,52

In [10]:
students_with_names.index = ["11", "22", "33", "44", "55"]

In [11]:
students_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
11,female,group B,bachelor's degree,standard,none,72,72,74
22,female,group B,master's degree,standard,none,90,95,93
33,male,group C,some college,standard,none,76,78,75
44,male,group B,some college,free/reduced,none,40,43,39
55,male,group C,associate's degree,standard,none,58,54,52

In [12]:
students_with_names.loc[['11', '44'], ['gender', 'math score']]

    gender  math score
11  female          72
44    male          40

In [13]:
students_x = students_with_names.iloc[:, 0]

In [14]:
students_x

11    female
22    female
33      male
44      male
55      male
Name: gender, dtype: object

In [15]:
type(students_x)

pandas.core.series.Series

In [16]:
type(students_with_names)

pandas.core.frame.DataFrame

In [17]:
se1 = pd.Series([1, 2, 'mantuu'], index=['11', '22', '33'])
se2 = pd.Series([5, 6, 'pelmeni'], index=['11', '22', '33'])

In [18]:
pd.DataFrame({'col1': se1, 'col2': se2})

      col1     col2
11       1        5
22       2        6
33  mantuu  pelmeni

In [19]:
students_with_names['gender']

11    female
22    female
33      male
44      male
55      male
Name: gender, dtype: object

In [20]:
students.iloc[:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [21]:
students.loc[:6]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [22]:
students.loc[:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39

In [23]:
titanic = pd.read_csv('./titanic.csv')

In [24]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [25]:
titanic.dtypes.value_counts()

object     5
int64      5
float64    2
dtype: int64

In [26]:
titanic.shape

(891, 12)

In [27]:
students.gender == 'male'

0      False
1      False
2      False
3       True
4       True
       ...
995    False
996     True
997    False
998    False
999    False
Name: gender, Length: 1000, dtype: bool

In [28]:
students.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [29]:
students.loc[students.gender == 'male']

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55

In [30]:
students.loc[students['writing score'] > 80]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
16,male,group C,high school,standard,none,88,89,86
34,male,group E,some college,standard,none,97,87,82
...,...,...,...,...,...,...,...,...
983,female,group A,some college,standard,completed,78,87,91
984,female,group C,some high school,standard,none,74,75,82
989,female,group D,some college,free/reduced,completed,67,86,83
995,female,group E,master's degree,standard,completed,88,99,95
999,female,group D,some college,free/reduced,none,77,86,86

In [31]:
students['writing score'].mean()

68.054

In [32]:
students[(students['writing score'] > 50) & (students.gender == 'female')]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [33]:
count = students.loc[students['lunch'] == 'free/reduced'].shape[0]
dolya = count / students.shape[0]

In [34]:
count

355

In [35]:
std = pd.read_csv('./qweqwe.csv')

In [36]:
std.shape

(1000, 8)

In [37]:
students.loc[students['lunch'] == 'standard'].mean()

math score       70.034109
reading score    71.654264
writing score    70.823256
dtype: float64

In [38]:
students.loc[students['lunch'] == 'free/reduced'].mean()

math score       58.921127
reading score    64.653521
writing score    63.022535
dtype: float64

In [39]:
students.loc[students['lunch'] == 'standard'].var()

math score       186.418089
reading score    191.285560
writing score    205.620887
dtype: float64

In [40]:
students.loc[students['lunch'] == 'free/reduced'].var()

math score       229.824270
reading score    221.871139
writing score    238.202881
dtype: float64

In [41]:
students = students \
    .rename(columns={'parental level of education': 'parental_level_of_education',
                            'test preparation course': 'test_preparation_course',
                            'reading score': 'reading_score',
                             'math score': 'math_score',
                            'writing score': 'writing_score'})

In [42]:
students.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [43]:
students.query("writing_score > 74")

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
995,female,group E,master's degree,standard,completed,88,99,95
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [44]:
query_value = 95

In [45]:
students.query("writing_score > @query_value")

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
106,female,group D,master's degree,standard,none,87,100,100
110,female,group D,associate's degree,free/reduced,completed,77,89,98
114,female,group E,bachelor's degree,standard,completed,99,100,100
165,female,group C,bachelor's degree,standard,completed,96,100,100
179,female,group D,some high school,standard,completed,97,100,100
373,female,group D,some college,standard,completed,82,97,96
377,female,group D,master's degree,free/reduced,completed,85,95,100
403,female,group D,high school,standard,completed,88,99,100
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
546,female,group A,some high school,standard,completed,92,100,97
566,female,group E,bachelor's degree,free/reduced,completed,92,100,100
580,female,group D,some high school,standard,none,81,97,96
594,female,group C,bachelor's degree,standard,completed,92,100,99
625,male,group D,some college,standard,completed,100,97,99
652,female,group D,some college,standard,completed,85,86,98
685,female,group E,master's degree,standard,completed,94,99,100
712,female,group D,some college,standard,none,98,100,99
717,female,group C,associate's degree,standard,completed,96,96,99
855,female,group B,bachelor's degree,standard,none,97,97,96
903,female,group D,bachelor's degree,free/reduced,completed,93,100,100
916,male,group E,bachelor's degree,standard,completed,100,100,100
941,female,group D,master's degree,standard,none,78,91,96
957,female,group D,master's degree,standard,none,92,100,100
962,female,group E,associate's degree,standard,none,100,100,100
970,female,group D,bachelor's degree,standard,none,89,100,100

In [46]:
columns = [i for i in list(students) if 'score' in i]

In [47]:
columns

['math_score', 'reading_score', 'writing_score']

In [48]:
students[columns]

     math_score  reading_score  writing_score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [49]:
students.filter(like='score', axis=1)

     math_score  reading_score  writing_score
0            72             72             74
1            69             90             88
2            90             95             93
3            47             57             44
4            76             78             75
..          ...            ...            ...
995          88             99             95
996          62             55             55
997          59             71             65
998          68             78             77
999          77             86             86

[1000 rows x 3 columns]

In [50]:
students.groupby('gender').mean()

        math_score  reading_score  writing_score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [52]:
students.groupby('gender', as_index=False)\
    .aggregate({'math_score': 'mean', 'reading_score': 'var'})
    .rename(columns = {'math_score': 'mean_math_score', 'reading_score': 'var'})

IndentationError: unexpected indent (<ipython-input-52-9a4f04366143>, line 3)

In [ ]:
students.groupby('gender', as_index=False) \
    .aggregate({'math_score': 'mean', 'reading_score': 'var'}) \
    .rename(columns = {'math_score': 'mean_math_score', 'reading_score': 'var_reading_score'})

In [ ]:
mean_scores = students.groupby(['gender', 'lunch', 'test_preparation_course']).mean()

In [ ]:
mean_scores

In [ ]:
students.index

In [ ]:
mean_scores.loc[('female', 'standard', 'completed')]

In [ ]:
students.groupby(['gender', 'lunch']).math_score.nunique()

In [ ]:
students.sort_values(['gender', 'math_score'], ascending=False) \
    .groupby('gender').head()

In [ ]:
students['total_score'] = students.math_score + students.reading_score + students.writing_score

In [ ]:
students.head()

In [ ]:
students = students.assign(total_score_log = np.log(students.total_score))

In [ ]:
students.head()

In [ ]:
students.drop(['total_score'], axis=1)

In [ ]:
heroes = pd.read_csv('./dota_hero_stats.csv')

In [ ]:
heroes

In [ ]:
heroes.groupby('legs').size()

In [ ]:
accountancy = pd.read_csv('./accountancy.csv')

In [ ]:
accountancy.head()

In [ ]:
accountancy.groupby(['Type', 'Executor']).mean()

In [ ]:
heroes

In [ ]:
heroes.groupby(['attack_type', 'primary_attr']).size()

In [ ]:
algae = pd.read_csv('./algae.csv')

In [ ]:
algae

In [ ]:
algae.query("genus == 'Fucus'")['alanin'].min()

In [ ]:
algae.query("genus == 'Fucus'")['alanin'].mean()

In [ ]:
algae.query("genus == 'Fucus'")['alanin'].max()

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
students.head()

In [ ]:
students.total_score.hist()

In [ ]:
students.plot.scatter(x='math_score', y='total_score')

In [ ]:
ax = sns.lmplot(x='math_score', y='total_score', hue='gender', data=students)
ax.set_xlabels('Math score')
ax.set_ylabels('Total score')

In [ ]:
students.plot()

In [ ]:
students.math_score.plot(kind='line')

In [ ]:
sns.lineplot(data=students.math_score)

In [ ]:
plt.plot(students.index, students.math_score)

In [ ]:
df = pd.read_csv("dataset_209770_6.txt", sep=" ")

In [ ]:
df.plot.scatter(x='x', y='y')

In [ ]:
gm = pd.read_csv('./genome_matrix.csv', index_col=0)

In [ ]:
gm.head()

In [ ]:
ax = sns.heatmap(gm, cmap="viridis")
ax.xaxis.set_ticks_position('top')
ax.xaxis.set_tick_params(rotation=90)

In [ ]:
hr = pd.read_csv('./dota_hero_stats_1.csv')

In [ ]:
hr.head(10)

In [ ]:
hr = hr.assign(cnt = hr.roles.str.count(',')+1)

In [ ]:
hr

In [ ]:
hr.groupby('cnt').size()

In [ ]:
iris = pd.read_csv('./iris.csv')

In [ ]:
iris.head(20)

In [ ]:
sns.displot(iris['sepal length'], color="blue")
sns.displot(iris['sepal width'], color="green")
sns.displot(iris['petal length'], color="yellow")
sns.displot(iris['petal width'], color="orange")

In [ ]:
sns.violinplot(y=iris['petal length'])

In [ ]:
sns.pairplot(iris, hue='species')

In [ ]:
ex = pd.DataFrame([['A', 10], ['A', 14], ['B', 12], ['A', 23]], columns=['type', 'value'])

In [ ]:
ex

In [ ]:
stat = pd.read_csv('./my_stat.csv')

In [ ]:
stat

In [ ]:
subset_1 = stat.head(10).V1 + stat.head(10).V2

In [ ]:
type(subset_1)

In [ ]:
subset_1 = stat.iloc[0:10, [0, 2]]
subset_2 = stat.iloc[:, [1, 3]].drop([0, 4])

In [ ]:
subset_2

In [ ]:
stat

In [ ]:
subset_1 = stat.query("V1 > 0 & V3 == 'A'")

In [ ]:
subset_1

In [ ]:
subset_2 = stat.query("V2 != 10 | V4>=1")

In [ ]:
subset_2

In [ ]:
stat['V5'] = stat.V1 + stat.V4
stat = stat.assign(V6 = np.log(stat.V2))

In [ ]:
stat

In [ ]:
stat = stat.rename(columns = {'V1': 'session_value', 'V2': 'group', 'V3': 'time', 'V4': 'n_users'})

In [ ]:
stat

In [ ]:
stat = pd.read_csv('./my_stat_1.csv')

In [ ]:
stat.head()

In [ ]:
stat = stat.fillna(0)

In [ ]:
stat_1 = stat.query("n_users >= 0")

In [ ]:
median = stat_1['n_users'].median()

In [ ]:
median

In [ ]:
stat

In [ ]:
stat.loc[stat.n_users < 0, 'n_users'] = median

In [ ]:
stat

In [ ]:
my_stat = pd.read_csv('./my_stat_1.csv')
my_stat = my_stat.fillna(0)
stat_1 = my_stat.query("n_users >= 0")
median = stat_1['n_users'].median()
my_stat.loc[my_stat.n_users < 0, 'n_users'] = median

In [ ]:
my_stat

In [ ]:
my_stat = pd.read_csv('./my_stat_1.csv')

In [ ]:
my_stat = my_stat.groupby('group', as_index=False).agg({'session_value': 'mean'})

In [ ]:
mean_session_value_data = my_stat.rename(columns={'session_value': 'mean_session_value'})

In [ ]:
mean_session_value_data